Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: Controlled buffers can be useful when you have a wire (often called a bus) whose value should match the output of one of several components.
ru_ru: Управляемые буферы могут быть полезны, когда у вас есть провод (часто называемый шина), значение на котором должно соответствовать выходу одного из нескольких компонентов.

source: Note that Logisim may also intermittently close and later re-open the file during the simulation, particularly if several seconds have elapsed without any new records being added.
ru_ru: Обратите внимание, что Logisim может периодически закрывать и затем повторно открывать файл при моделировании; в частности, если прошло несколько секунд без добавления каких-либо новых записей.

source: A unit in sophomore-level computer organization courses
ru_ru: Как элемент курса организации ЭВМ следующего уровня

source: Determines whether to draw a larger or a smaller version of the component.
ru_ru: Определяет следует отрисовывать большую или меньшую версию компонента.

source: For our example, Logisim displays the table below.
ru_ru: В нашем примере Logisim выводит таблицу, представленную ниже.

source: whole or in part contains or is derived from the Program or any
ru_ru: целиком, и которое полностью или частично содержит Программу или какую-либо

source: Distribution
ru_ru: Распространение

source: The lower dataBits bits of the product of the two values coming in the west edge, plus the cin value.
ru_ru: Младшие битыДанных битов произведения двух значений, поступающих на западный край плюс значение cin.

source: Next: Command line options.
ru_ru: Далее: Параметры командной строки.

source: As you test larger circuits, you will likely find bugs.
ru_ru: Когда вы проверяете большие схемы, вы скорее всего находите ошибки.

source: In contrast, a wire's bit width is undefined: Instead, the wire's width adapts to the components to which it is attached.
ru_ru: Разрядность провода, напротив, не определена: вместо этого она подстраивается под компоненты, к которым провод присоединён.

source: That is, the remainder will always be between 0 and divisor-1.
ru_ru: Таким образом, остаток всегда будет между 0 и делитель-1.

source: To help identify which points in the overall circuit have changed, any points whose values change are indicated with a blue circle; if a subcircuit contains any points that have changed in it (or its subcircuits, recursively), then it will be drawn with a blue outline.
ru_ru: Чтобы помочь определить, какие пункты во всей схеме были изменены, любые точки, значения на которых изменились, указаны синим кругом; если подсхема содержит точки, значения на которых были изменены в ней (или её подсхемах, рекурсивно), то она будет отрисована с синей обводкой.

source: Dark green: The wire is carrying a one-bit 0 value.
ru_ru: Тёмно-зелёный: Провод несёт однобитное значение 0.

source: The counter holds a single value, whose value is emitted on the output Q.
ru_ru: Счётчик хранит одно значение, которое выдаётся на выход Q.

source: Any subcircuits will also appear in the list; they cannot be selected for logging, but eligible components within them can be.
ru_ru: Все подсхемы также появятся в списке; их нельзя выбрать для записи, но подходящие компоненты внутри них - можно.

source: JAR Libraries
ru_ru: Библиотеки JAR

source: This component implements a very simple dumb terminal.
ru_ru: Этот компонент реализует очень простой терминал.

source: Now add the other gates.
ru_ru: Теперь добавьте другие элементы.

source: And if Input, the component has a second input on its north side whose one-bit value is used for the additional bits.
ru_ru: И если Вход, то компонент имеет второй вход на северной стороне, однобитное значение на котором используется для дополнительных битов.

source: Creates image file(s) corresponding to circuits.
ru_ru: Создаёт файл(ы) изображений, соответствующие схемам.

source: highest precedence
ru_ru: высший приоритет

source: Now we can simply run Logisim substituting each query file.
ru_ru: Теперь мы можем просто запускать Logisim, подставляя каждый проверяемый файл.

source: Also, manipulating a component via the Poke tool () or the Text tool () will display that component's attributes.)
ru_ru: Кроме того, взаимодействие с компонентом через Инструмент Нажатие () или Инструмент Текст () покажет атрибуты этого компонента.)

source: Poke Tool
ru_ru: Инструмент Нажатие

source: Random
ru_ru: Генератор случайных чисел

source: The computed output.
ru_ru: Вычисленное выходное значение.

source: The direction in which the component's pin lies from component's center.
ru_ru: Направление, в котором расположен контакт относительно центра компонента.

source: If sel and ld are 1 or floating, then the RAM component emits the value found at the currently selected address on this port.
ru_ru: Если на входах sel и ld 1 или плавающее значение, то компонент ОЗУ выдаёт на этот порт значение по выбранному в данный момент адресу.

source: The RAM component, easily the most complex component in Logisim's built-in libraries, stores up to 16,777,216 values (specified in the Address Bit Width attribute), each of which can include up to to 32 bits (specified in the Data Bit Width attribute).
ru_ru: Компонент ОЗУ, бесспорно самый сложный компонент встроенной библиотеки Logisim, хранит до 16777216 значений (это задаётся в атрибуте Разрядность адреса), каждое из которых может включать до 32 битов (задаётся в атрибуте Разрядность данных).

source: Reset Simulation
ru_ru: Сбросить моделирование

source: Create a line segment.
ru_ru: Создать отрезок линии.

source: // Value objects, which are immutable, so we don't care that both the copy
ru_ru: // объектами Value, которые неизменяемы, так что нас не волнует, что и копия,

source: In addition to the output Q, the component also includes a single-bit output carry.
ru_ru: В дополнение к выходу Q компонент также имеет однобитный выход перенос.

source: Project options
ru_ru: Параметры проекта

source: Base
ru_ru: Базовые

source: // Again, notice how we don't have any instance variables related to an
ru_ru: // Опять же, заметьте, что у нас нет никаких переменных экземпляра, связанных с

source: And you can copy and paste values using the clipboard.
ru_ru: И вы можете копировать и вставлять значения, используя буфер обмена.

source: Current values are displayed in the component.
ru_ru: Текущие значения отображаются в компоненте.

source: When the component is selected or being added, Alt-0 through Alt-9 alter its Data Bits attribute.
ru_ru: Когда компонент выбран, или уже добавлен, комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных.

source: The clear input resets all stages to 0 (all zeroes) asynchronously; that is, as long as the clear input is 1, all values are pinned to 0, regardless of the clock input.
ru_ru: Вход Очистка асинхронно сбрасывает все ступени на 0 (все нули); кроме того, пока на входе Очистка 1, все значения фиксированы на 0, вне зависимости от тактового входа.

source: quotient * divisor + remainder = dividend .
ru_ru: частное * делитель + остаток = делимое .

source: East edge (output, bit width matches the Data Bits attribute)
ru_ru: Восточный край (выход, разрядность соответствует атрибуту Биты данных)

source: Step 1: Adding gates
ru_ru: Шаг 1: Добавление логических элементов

source: Printer view: Specifies whether to display the circuit on the screen in the same way it is displayed through the printer.
ru_ru: Вид для печати: определяет, показывать ли схемы на экране так же, как они выводятся через принтер.

source: As a result, when this circuit's input changes from 0 to 1, the AND gate will briefly see two 1 inputs, and it will emit a 1 briefly.
ru_ru: В результате, когда значение на входе этой цепи изменяется с 0 на 1, элемент И будет короткое время видеть 1 на обоих входах, и выдаст на выходе 1 на короткое время.

source: The Simulation tab
ru_ru: Вкладка Моделирование

source: Shows the current Combinational Analysis window, without changing any of its contents.
ru_ru: Показывает текущее окно Комбинационного анализа без изменения его содержимого.

source: When you paste wires from the clipboard, however, you may want them to appear in a different location, and the changing inherent in the merging process would be against your wishes.
ru_ru: Когда вы вставляете провода из буфера обмена, вам может понадобиться разместить их в другом месте, и изменения, сделанные процессом слияния, будут вопреки вашим желаниям.

source: We can then compare the two output files using a program built for that purpose.
ru_ru: Мы можем сравнить два файла с помощью программы, написанной для таких целей.

source: Pop-up menus and files
ru_ru: Всплывающие меню и файлы

source: If yes, then the LED is colored when the input is 1.
ru_ru: Если да , то светодиод подсвечен, когда значение на входе 1.

source: If no inputs are 1, or if the component is disabled, then the output of the priority encoder is floating.
ru_ru: Если на входах нет 1, или если компонент выключен, то выход шифратора приоритетов плавающий.

source: The tools in the toolbar each have a separate attribute set from the corresponding tools in the explorer pane.
ru_ru: Каждый инструмент на панели инструментов имеет независимый набор атрибутов, свойственных соответствующему инструменту на панели проводника.

source: Available - this is 1 when the buffer contains at least one character and 0 when the buffer is empty.
ru_ru: Наличие - значение равно 1, когда буфер содержит хотя бы один символ, и 0, когда буфер пуст.

source: Each project has a designated "main circuit," which can be changed to refer to the current circuit via the Set As Main Circuit option in the Project menu.
ru_ru: Каждый проект имеет назначенную "главную схему", которой можно сделать текущую схему через пункт Сделать главной схемой из меню Проект.

source: (This alternative is
ru_ru: (Эта возможность

source: Entries are placed into the file in tab-delimited format corresponding closely to what appears under the Table tab.
ru_ru: Записи помещаются в файл с разделителями в виде символов табуляции, близко к тому, что появляется на вкладке Таблица.

source: For the first drag, where you specify the curve's endpoints, shift-drag keeps the endpoints at an angle that is a multiple of 45°.
ru_ru: При первом перетаскивании, когда вы задаёте конечные точки кривой, перетаскивание мыши с зажатой Shift держит конечные точки под углом, кратным 45°.

source: I left a little space between the NOT gates and the AND gates; if you want to, though, you can put them up against each other and save yourself the effort of connecting them with a wire later.
ru_ru: Я оставил немного пространства между элементами НЕ и элементами И; если хотите, однако, вы можете расположить их сразу друг за другом и сэкономить свои усилия на соединении их проводами позже.

source: Segments are either colored or light gray depending on the inputs.
ru_ru: Сегменты либо подсвечены цветом, либо светло-серого цвета в зависимости от входных данных.

source: It brings up the Options window with several tabs.
ru_ru: Это вызовет окно Параметры с несколькими вкладками.

source: The Set As Expression button allows you to select the minimized expression as the expression corresponding to the variable.
ru_ru: Кнопка Установить как выражение позволяет вам выбрать минимизированное выражение как выражение, соответствующее переменной.

source: If, however, you have multiple projects open under the same Logisim process, then you should be able to cut/copy/paste between them.
ru_ru: Однако, если у вас есть несколько проектов, открытых одним и тем же процессом Logisim, то вы можете вырезать/ копировать/вставлять между ними.

source: Otherwise, clicking the component will bring keyboard focus to the clicked stage (indicated by a red rectangle), and typing a hexadecimal digit will change the value stored in that stage.
ru_ru: В противном случае нажатие на компонент передаст фокус клавиатуры нажатой ступени (обозначается красным прямоугольником), и ввод шестнадцатеричных цифр будет изменять значение, хранящееся в этой ступени.

source: We can't put that here, because only one
ru_ru: Мы не можем поместить их здесь, потому что только один

source: The circle option means that each pixel is drawn as a diameter-8 circle, with gaps between each circle.
ru_ru: Вариант Круглая означает, что каждый пиксель отрисовывается как круг с диаметром 8, с пробелами между кругами.

source: The falling edge value indicates that it should update at the instant the clock falls from 1 to 0.
ru_ru: Значение Задний фронт означает, что он должен обновляться, когда значение на тактовом входе меняется с 1 на 0.

source: The number of inputs to the multiplexer will be 2selectBits.
ru_ru: Количество входов для мультиплексора будет равно 2Выбирающие_биты.

source: And finally, I want to thank all the users who have contacted me - whether with bug reports, with suggestions, or just to let me know that they're using Logisim in their classes.
ru_ru: И наконец, я хотел бы поблагодарить всех тех пользователей, которые связались со мной - будь то по поводу сообщения об ошибке, предложения, или просто чтобы дать мне знать, что они используют Logisim в своих курсах.

source: The value, written in hexademical, that is emitted by the component.
ru_ru: Значение, выдаваемое компонентом, записанное в шестнадцатеричном виде.

source: The drop-down box allows you to change this behavior so that Logisim stays at the same tool for adding more of the same component, until you yourself opt to choose the Edit Tool.
ru_ru: Этот выпадающий список позволяет вам изменить это поведение так, чтобы Logisim оставался на том же инструменте для добавления ещё одного такого же компонента, пока вы сами не выберите Инструмент Правка.

source: This tab allows configuration of Logisim according to regional preferences.
ru_ru: Эта вкладка позволяет настроить Logisim в соответствии с региональными предпочтениями.

source: A LED has only one pin, a 1-bit input which is used to determine whether to display the LED colored (when the input is 1) or darkened (when the input is anything else).
ru_ru: Светодиод имеет только один контакт, 1-битный вход, который используется для определения того, следует подсвечивать светодиод (когда на входе 1) или тушить (если на входе что-то другое).

source: Create a new circuit state? Clicking No will cancel the toggle request, while clicking Yes will create a copy of the viewed state, divorced from the outer circuit, with the input pin toggled.
ru_ru: Создать новое состояние схемы? Ответ Нет отменит запрос изменения, а ответ Да создаст копию просматриваемого состояния, оторванную от внешней схемы, с изменённым значением на входном контакте.

source: S-R Flip-Flop: When the clock triggers, the value remembered by the flip-flop remains unchanged if R and S are both 0, becomes 0 if the R input (Reset) is 1, and becomes 1 if the S input (Set) is 1.
ru_ru: S-R триггер: когда тактовый вход срабатывает, значение, хранящееся в триггере, остаётся неизменным, если на входах R и S - 0; становится 0, если на входе R (Сброс) - 1, и становится 1, если на входе S (Установка) - 1.

source: A template is a Logisim file that is used as a starting point whenever Logisim creates a new project.
ru_ru: Шаблон - это файл Logisim, который используется как отправная точка каждый раз, когда Logisim создаёт новый проект.

source: Edit Circuit Appearance
ru_ru: Редактировать внешний вид схемы

source: Next: Step 2: Adding wires
ru_ru: Далее: Шаг 2: Добавление проводов

source: With some tools, the tool's icon reflects some of the attributes' values.
ru_ru: Для некоторых инструментов значок инструмента отражает некоторые из значений атрибутов.

source: To remove an input, select it from the list and click Remove.
ru_ru: Чтобы удалить вход, выберите его из списка и нажмите кнопку Удалить.

source: The DIN 40700 standard was a standard for drafting digital and analog electronic components adopted by DIN, a German standards organization.
ru_ru: Стандарт DIN 40700 был стандартом для разработки цифровых и аналоговых электронных компонентов, принятым DIN, немецкой организацией по стандартизации.

source: Note that if dist contains any floating or error inputs, then the output is composed entirely of error values, since there is no way to guess how far to shift the input.
ru_ru: Обратите внимание, что если дистанция содержит плавающие значения или значения ошибки, то выход полностью состоит из значений ошибки, поскольку нет способа догадаться, на сколько сдвигать входное значение.

source: * example illustrates how a component can maintain its own internal state.
ru_ru: * пример показывает, как компонент может сохранять своё внутреннее состояние.

source: This can be particularly useful in a laboratory of single-student computers where you want Logisim to start up the same for students every time, regardless of how previous students may have configured the program.
ru_ru: Это может быть особенно полезным в лаборатории с одним компьютером на учащегося, где вы хотите запускать Logisim каждый раз одинаково, вне зависимости от того, как предыдущие студенты могли настроить программу.

source: Otherwise, you will see an error message and the window will not open.
ru_ru: В противном случае вы увидите сообщение об ошибке и окно не откроется.

source: The file format used for image files is intentionally simple; this permits you to write a program, such as an assembler, that generates memory images that can then be loaded into memory.
ru_ru: Формат файла, используемый для файлов образов, намеренно сделан простым; это позволяет вам писать программы, такие как ассемблер, которые генерируют образы памяти, которые могут быть загружены в память.

source: * information associated with individual instances should be handled
ru_ru: * информацией, связанной с отдельными экземплярами нужно работать

source: When 1, the flip-flop's value is pinned to 1.
ru_ru: Пока на нём 1, значение триггера фиксировано на 1.

source: Negate x
ru_ru: Инвертировать x

source: Thus, a value of 1 represents the far left, and the maximum value for the bit width indicates the far right.
ru_ru: Таким образом, значение 1 соответствует крайнему левому положению, а максимальное для разрядности значение - крайнему правому положению.

source: D/T/J-K/S-R Flip-Flop
ru_ru: D/T/J-K/S-R триггеры

source: But above the floating or error bit, the result will have floating or error bits.
ru_ru: Но выше плавающего бита или бита с ошибкой результат будет иметь плавающие биты или биты с ошибкой.

source: In this way, you can insert a 5-input gate but only attach two inputs, and it will work as a 2-input gate; this relieves you from having to worry about configuring the number of inputs every time you create a gate.
ru_ru: Таким образом, вы можете добавить 5-входовый элемент, но подключить только два входа, и он будет работать как 2-входовый элемент; это избавляет вас от необходимости беспокоиться о настройке количества входов каждый раз при создании элемента.

source: The only supported control sequences are: backspace (ASCII 8), which deletes the last character in the final row, unless the final row is already empty; newline (ASCII 10), which moves the cursor to the beginning of the following line, scrolling if necessary; and form-feed (ASCII 12, typed as control-L), which clears the screen.
ru_ru: Поддерживаемые управляющие последовательности: Backspace (ASCII 8), которая удаляет последний символ в последней строке, если она не пуста; переход на следующую строку (ASCII 10), которая перемещает курсор в начало следующей строки, прокручивая строки, если необходимо; и подача страницы (ASCII 12, печатается как Control-L), которая очищает экран.

source: Value
ru_ru: Значение

source: Under Linux or MacOS X, you might want to use the cmp or diff command-line utilities.
ru_ru: Под Linux или MacOS X вы можете использовать утилиты командной строки cmp или diff.

source: Select the Edit Tool ().
ru_ru: Выберите Инструмент Правка ().

source: The remainder of the division.
ru_ru: Остаток от деления.

source: It could also arise because two components are trying to send different values onto the wire; this is what happens in the above example, where one input pin places 0 onto the wire while another places 1 onto the same wire, causing a conflict.
ru_ru: Также это часто возникает из-за того, что два компонента пытаются передать проводу два разных значения; это то, что происходит в примере выше, где один входной контакт передаёт проводу 0, а другой - передаёт 1 тому же проводу, вызывая конфликт.

source: Lite-On sells such components, for example.)
ru_ru: Например, Lite-On продаёт такие компоненты.)

source: Tool Attributes
ru_ru: Атрибуты инструментов

source: Then, Logisim will prompt you to select the JAR file.
ru_ru: Затем Logisim предложит вам выбрать JAR файл.

source: The result of shifting the input value by the input distance.
ru_ru: Результат сдвига входного значения на количество позиций, заданное другим входом.

source: For example, given the 8-bit input 10011101, the output would be 5, since there are five 1-bits in the input (the first, the last, and a string of three bits in the middle).
ru_ru: Например, при 8-битном значении на входе 10011101, на выходе будет 5, поскольку здесь пять битов 1 на входе (первый, последний, и строка из трех битов в середине).

source: You can view and edit project options via the Options... option from the Project menu.
ru_ru: Вы можете просматривать и редактировать параметры проекта через пункт Параметры... из меню Проект.

source: The StdAttr class defines several commonly occurring
ru_ru: Класс StdAttr объявляет некоторые часто встречающиеся

source: If you're quite comfortable with the command line, you can build your own shell script to accomplish this.
ru_ru: Если вы ладите с командной строкой, вы можете создать свой собственный скрипт для решения этой задачи.

source: In the built-in libraries of the current version of Logisim, the only such components are RAM and ROM.
ru_ru: Во встроенных библиотеках текущей версии Logisim это только компоненты ОЗУ и ПЗУ.

source: Dealing with gate delays well across subcircuits, though, is a bit more complex; Logisim does attempt to address this correctly by placing all primitive component's propagation values into a single schedule regardless of the subcircuit in which the component lies.
ru_ru: Удачное манипулирование с задержками элементов в подсхемах, однако, является немного более сложным; Logisim пытается справиться с этим, располагая просчитываемые для примитивных компонентов значения в одну очередь, независимо от подсхемы, в которой находится компонент.

source: Wire bundles
ru_ru: Пучки проводов

source: Both data and output have the same number of bits in them.
ru_ru: И данные, и выход имеют одинаковое количество битов.

source: Except for the issue of gate delays, Logisim does not particularly concern itself with timing issues.
ru_ru: За исключением вопроса задержки логических элементов, Logisim не особенно заботится о вопросах синхронизации.

source: Under Windows, you might want to use WinMerge.
ru_ru: Под Windows вы можете использовать WinMerge.

source: South edge, west end (input, bit width 1)
ru_ru: Южный край, западный контакт (вход, разрядность равна 1)

source: // As it happens, InstancePainter contains several convenience methods
ru_ru: // Когда это происходит, InstancePainter содержит несколько удобных методов

source: Step 2: Adding wires
ru_ru: Шаг 2: Добавление проводов

source: Files produced by Logisim will use run-length encoding for runs of at least four values.
ru_ru: Файлы, созданные Logisim, будут использовать кодирование повторов для последовательностей из по крайней мере четырёх одинаковых значений.
